In [2]:
import pandas as pd
import numpy as np

# 연습문제

### 4.1

(1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

In [3]:
a = pd.Series([1000, 2000, 3000],
                index =["cherry","apple","orange"])
a

cherry    1000
apple     2000
orange    3000
dtype: int64

In [4]:
b = pd.Series([4000, 5000, 6000],
                index =["cherry","grape","orange"])
b

cherry    4000
grape     5000
orange    6000
dtype: int64


(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [5]:
b-a

apple        NaN
cherry    3000.0
grape        NaN
orange    3000.0
dtype: float64

In [6]:
b + a

apple        NaN
cherry    5000.0
grape        NaN
orange    9000.0
dtype: float64

In [7]:
b / a

apple     NaN
cherry    4.0
grape     NaN
orange    2.0
dtype: float64

In [8]:
b * a

apple            NaN
cherry     4000000.0
grape            NaN
orange    18000000.0
dtype: float64

### 4.1.2

다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

- (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
- (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [9]:
pd.DataFrame({
    'int1':[1,2,3,4,5],
    'int2':[10,20,30,40,50],
    'int3':[100,200,300,400,500],
    'string':['a','b','c','d','e'],
    'float':[3.14,1.414,1.732,2.718,2.235]
})

   int1  int2  int3 string  float
0     1    10   100      a  3.140
1     2    20   200      b  1.414
2     3    30   300      c  1.732
3     4    40   400      d  2.718
4     5    50   500      e  2.235

### 4.1.3

다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

In [24]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df2 = pd.DataFrame(data, index=index, columns=columns)
df2

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [11]:
#(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df2['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [12]:
#(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df2[["국어","영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [13]:
#(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df2["평균"] = np.mean(df2[["국어","영어","수학"]].T).round(2)
df2

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [33]:
#(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df2.loc["방자","영어"] = 80
df2

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  46.67

In [36]:
df2["평균"] = np.mean(df2[["국어","영어","수학"]].T).round(2)
df2

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [ ]:
del df2['평균']
df2['영어'][3] = 80
df2['평균'] = np.round(df2.mean(axis=1), 2)
df2

In [18]:
#(5) 춘향의 점수를 데이터프레임으로 나타낸다.
df2[:1]

    국어  영어  수학
춘향  80  90  90

In [22]:
df2[:'춘향']

    국어  영어  수학
춘향  80  90  90

In [19]:
#(6) 향단의 점수를 시리즈로 나타낸다.
df2.iloc[2]

국어    70
영어    60
수학    80
Name: 향단, dtype: int64

In [21]:
df2.T['향단']

국어    70
영어    60
수학    80
Name: 향단, dtype: int64

### 4.3.1

In [49]:
#1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
data = {
    "JIM" : [10, 11, 13, 14, 15],
    "MIC" : [16, 17, 18, 19, 20],
    "PAM" : [21, 22, 23, 24, 25],
    "DW" : [26, 27, 28, 29, 30],
    "AN" : [31, 32, 33, 34, 35],
    "label" : ["A", "B", "C", "D", "E"],
    "label2" : ["aa", "bb", "cc", "dd", "ee"]
}
columns = ["label", "JIM", "MIC", "PAM", "DW", "AN", "label2"]
index = ["SD", "AC", "HR", "SD2", "IN"]

df3 = pd.DataFrame(data, index=index, columns=columns)
df3

    label  JIM  MIC  PAM  DW  AN label2
SD      A   10   16   21  26  31     aa
AC      B   11   17   22  27  32     bb
HR      C   13   18   23  28  33     cc
SD2     D   14   19   24  29  34     dd
IN      E   15   20   25  30  35     ee

In [ ]:
#2. 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [26]:
np.random.seed(2021)
df = pd.DataFrame(np.random.randint(1, 100, 25).reshape(5,5),
                  index=['a','b','c','d','e'],
                  columns=['v','w','x','y','z'])
df

    v   w   x   y   z
a  86  58   1  95  87
b  45  63  92  30  22
c  94  25  13  71  71
d  34   8   2  98  27
e  67  49  64  50  17

In [27]:
# 2) 63을 선택
df['w']['b'], df.w['b'], df.w[1], df.w.b

(63, 63, 63, 63)

In [28]:
df.loc['b','w'], df.loc['b']['w'], df.loc['b'][1]

(63, 63, 63)

In [29]:
df.iloc[1,1], df.iloc[1][1], df.iloc[1]['w']

(63, 63, 63)

###  4.4.1

In [30]:
# 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### 4.4.2

In [ ]:
#sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class)인원수, 사망/생존(alive) 인원수를 구하라.

In [31]:
#성별(sex) 인원수
titanic.sex.value_counts().sort_values()

female    314
male      577
Name: sex, dtype: int64

In [32]:
#나이별(age) 인원수
titanic.age.value_counts().sort_values()

12.00     1
24.50     1
66.00     1
20.50     1
0.67      1
         ..
19.00    25
28.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [5]:
#선실별(class)인원수
titanic["class"].value_counts().sort_values()

Second    184
First     216
Third     491
Name: class, dtype: int64

In [7]:
#사망/생존(alive) 인원수를 구하라.
titanic.alive.value_counts().sort_values()

yes    342
no     549
Name: alive, dtype: int64

### 4.4.3

In [94]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [84]:
#타이타닉호 승객의 평균 나이를 구하라.
titanic.age.mean().round(2)

29.7

In [10]:
#타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
titanic[titanic.sex == 'female'].age.mean().round(2)

27.92

In [13]:
#타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
dft = titanic[titanic.pclass == 1]
dft[dft.sex == 'female'].age.mean().round(2)

34.61

### 4.4.4

In [33]:
titanic1 = titanic[['survived', 'pclass', 'sex','age']]

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.

- 20살이 넘으면 성별을 그대로 사용한다.
- 20살 미만이면 성별에 관계없이 “child”라고 한다.

In [34]:
titanic['category1'] = titanic.apply(
    lambda r: r.sex if r.age >= 20 else 'child', axis=1
)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

### 4.4.5

타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

In [36]:
import warnings
warnings.filterwarnings('ignore')

In [38]:
# titanic['age'] = titanic.age.fillna(np.round(titanic.age.mean()))
titanic.age.fillna(np.round(titanic.age.mean()), inplace=True)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

### 4.4.6

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.

- 성별을 나타내는 문자열 male 또는 female로 시작한다.
- 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.
- 예를 들어 27살 남성은 male27 값이 된다.

In [39]:
titanic['category2'] = titanic.sex + titanic.age.astype(int).astype(str)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,male27
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,female19
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,female30
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,male26
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,male32

###  4.4.7

In [ ]:
타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.

In [40]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(titanic.age.values, bins, labels=labels)
cats

['청년', '중년', '청년', '중년', '중년', ..., '청년', '미성년자', '청년', '청년', '중년']
Length: 891
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [41]:
cats.value_counts()

미성년자    165
청년      407
중년      241
장년       59
노년        5
dtype: int64

In [42]:
df = pd.DataFrame(cats.value_counts(), columns=['인원수'])
df

      인원수
미성년자  165
청년    407
중년    241
장년     59
노년      5

In [43]:
df['비율(%)'] = np.round(df['인원수'] / df['인원수'].sum() * 100, 2)
df

      인원수  비율(%)
미성년자  165  18.81
청년    407  46.41
중년    241  27.48
장년     59   6.73
노년      5   0.57

In [44]:
df['비율(%)'].sum()

100.0

### 4.4.8

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.

- 20살 미만이면 성별에 관계없이 “미성년자”라고 한다.
- 20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

In [45]:
titanic['group'] = pd.cut(titanic.age.values, bins, labels=labels)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2,group
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,male27,청년
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,female19,미성년자
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,female30,청년
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,male26,청년
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,male32,중년

In [46]:
titanic['성별'] = titanic.apply(lambda r: '남성' if r.sex == 'male' else '여성', axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2,group,성별
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,male27,청년,남성
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,female19,미성년자,여성
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,female30,청년,여성
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,male26,청년,남성
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,male32,중년,남성

In [47]:
titanic['category3'] = titanic.apply(
    lambda r: r.group + r.성별 if r.age >= 20 else '미성년자', 
    axis=1
)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2,group,성별,category3
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,male27,청년,남성,청년남성
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,female19,미성년자,여성,미성년자
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,female30,청년,여성,청년여성
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,male26,청년,남성,청년남성
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,male32,중년,남성,중년남성

### 4.5.1

5명의 학생의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.

- 학생 이름을 나타내는 열을 포함시키지 않고 데이터프레임 df_score1 을 생성한 후, df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정한다. reset_index 명령으로 이 인덱스 열을 명령으로 일반 데이터열로 바꾸여 데이터프레임 df_score2을 만든다.

- 학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.

In [ ]:
np.random.seed(2021)
df_score1 = pd.DataFrame(np.random.randint)

### 4.5.2

In [ ]:
A 반 학생 5명과 B반 학생 5명의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.

“반”, “번호”, “국어”, “영어”, “수학” 을 열로 가지는 데이터프레임 df_score3을 만든다.

df_score3을 변형하여 1차 행 인덱스로 “반”을 2차 행 인덱스로 “번호”을 가지는 데이터프레임 df_score4을 만든다.

데이터 프레임 df_score4에 각 학생의 평균을 나타내는 행을 오른쪽에 추가한다.

df_score3을 변형하여 행 인덱스로 “번호”를, 1차 열 인덱스로 “국어”, “영어”, “수학”을, 2차 열 인덱스로 “반”을 가지는 데이터프레임 df_score5을 만든다.

데이터 프레임 df_score5에 각 반별 각 과목의 평균을 나타내는 행을 아래에 추가한다.

In [48]:
np.random.seed(2021)
df_score1 = pd.DataFrame(np.random.randint(40, 100, 15).reshape(5,3), 
                         columns=['국어','영어','수학'])
df_score1.index = ['김판다','이판다','박판다','최판다','정판다']
df_score1.index.name = '이름'
df_score1

     국어  영어  수학
이름
김판다  92  61  97
이판다  40  85  70
박판다  62  84  67
최판다  69  61  69
정판다  64  52  94

In [49]:
df_score2 = df_score1.reset_index()
df_score2

    이름  국어  영어  수학
0  김판다  92  61  97
1  이판다  40  85  70
2  박판다  62  84  67
3  최판다  69  61  69
4  정판다  64  52  94

In [50]:
df_score2.set_index('이름')

     국어  영어  수학
이름
김판다  92  61  97
이판다  40  85  70
박판다  62  84  67
최판다  69  61  69
정판다  64  52  94